app/controllers/books_controller.rb

  def index
    if current_user.admin?
      @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    book_params = params.require(:book).permit!
    @book = current_user.books.create(book_params)
---
INSERT INTO "books" ("name", "access", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "default"], ["access", ""], ["created_at", 2016-11-03 09:16:02 UTC], ["updated_at", 2016-11-03 09:16:02 UTC]]

  def update
    @book.update_attributes(params.require(:book).permit!)
---
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "Note1333"], ["updated_at", 2016-11-07 14:24:59 UTC], ["id", 8]]

  def find_book
    @book = Book.where(id: params[:id]).first
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? ORDER BY "books"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]