app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."access" = ?  [["access", "user"]]
---
  def index

    @books = Book


    if (current_user.role == 'admin')
      @books = @books.all
    else
      @books = Book.where(access: current_user.role)