app/controllers/notes_controller.rb

  def find_notebook
    @note = Note.where(notebook: params[:notebook]).first
---
SELECT "notes".* FROM "notes" WHERE "notes"."notebook" = ?  [["notebook", "Note1"]]