app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."access" = ?  [["access", "user"]]
SELECT "notes".* FROM "notes" WHERE "notes"."access" = ? AND "notes"."book_id" = ?  [["access", "admin"], ["book_id", "7"]]
---
  def index

   @notes = Note
   if (current_user.role == 'admin')
     @notes = @notes.all
   else
   @notes = Note.where(access: current_user.role)
   end
   @notes = @notes.where(book_id: @books)

INSERT INTO "notes" ("name", "body", "tags", "created_at", "updated_at", "access", "notebook") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "First"], ["body", "dasdas"], ["tags", "1,2,3"], ["created_at", 2016-11-03 15:45:22 UTC], ["updated_at", 2016-11-03 15:45:22 UTC], ["access", "admin"], ["notebook", "Note1"]]
---
  def create

    note_params = params.require(:note).permit!
    @note = Note.create(note_params)

UPDATE "notes" SET "name" = ?, "body" = ?, "tags" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["name", "Пароли"], ["body", "секреты"], ["tags", "12"], ["updated_at", 2016-11-04 14:00:35 UTC], ["id", 18]]
---
  def update

    @note.update_attributes(params.require(:note).permit!)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? ORDER BY "notes"."id" ASC LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def find_note
    @note = Note.where(id: params[:id]).first

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def set_book
    @books = Book.find(params[:book_id])